Repository: rotdrop/nextcloud-app-bav
Catalog: translationfiles/*/bav.po
Languages: de

source: Failed to validate IBAN
de: Die IBAN scheint nicht korrekt zu sein

source: Bank-id %1$s from IBAN and submitted bank-id %2$s do not coincide
de: Aus der IBAN abgeleitete BLZ %1$s und angegebene BLZ %2$s stimmen nicht überein

source: Account-id %1$s from IBAN and submitted account-id %2$s do not coincide
de: Aus der IBAN abgeleitet Kontonummer %1$s und angegebene Kontonummer %2$s stimmen nicht überein

source: Computed BIC %1$s and submitted BIC %2$s do not coincide
de: Automatisch ermittelte BIC %1$s und angegebene BIC %2$s stimmen nicht überein

source: Generated IBAN %1$s and submitted IBAN %2$s do not coincide
de: Berechnete IBAN %1$s und angegebene IBAN %2$s stimmen nicht überein

source: The account number %1$s @ %2$s does not appear to be a valid German bank account id
de: Die Kontonummer %1$s @ %2$s scheint ungültig zu sein

source: The bank-id %s does not seem to be a valid German bank id
de: Die BLZ %s scheint ungültig zu sein.

source: No errors found, but use at your own risk
de: Keine Fehler gefunden, aber benutzt das Zeug bitte auf eigenes Risko ;)

source: Installation problem; the required resource "%1$s" of type "%2$s" is not installed on the server, please contact the system administrator!
de: Installationsproblem; die %1$s-Ressource "%2$s" ist nicht auf dem Server installiert, bitte kontaktieren Sie den Systemadministrator!

source: German Bank Account Validator
de: BAV - Bank Account Validator (DE)

source: Provided data is not a valid SVG image: "{data}".
de: Die Daten konstituieren kein gültiges SVG-Bild: "{data}".

source: reason unknown
de: Grund unbekannt

source: Unable to validate the given bank account data: {message}
de: Kann die angegebenen Bankdaten nicht überprüfen: {message}

source: This is a front-end to the German Bank Account Validator (BAV) developed my M. Malkusch.
de: Diese App ist ein Front-End für den "Bank Account Validator" (BAV), der von M. Malkusch für die Überprüfung Deutscher Bankdaten geschrieben wurde.

source: The backend is no longer actively maintained, but there are some forks on GitHub ({github}). However, it still seems to work for the majority of German bank accounts.
de: Die Programmbibliothek wird nicht mehr gepflegt, aber es gibt noch aktive Ableger auf Github ({github}). Scheinbar funktioniert die Bibliothek aber noch für die meisten Deutschen Bankverbindungen.

source: Data entered will not be stored. BAV is able to compute the BIC given the bank-id, and to compute the IBAN given additionally the bank-account id. Additionally, it verifies that the bank-id exists by comparing it with the data provided by the Deutsche Bundesbank. It will also pick the correct check-sum formula for the given bank-account id (there are a few hundrets of possible check-sum formulas, differing from bank to bank, all archived and publically available at the Deutsche Bundesbank). Finally, given an IBAN, it will extract the bank-id and bank-account-id and also perform the check-sum computations in order to test whether the provided bank-account data is consistent.
de: Die eingegebenen Daten werden nicht gespeichert. BAV kann die BIC aus der BLZ berechnen, und außerdem die IBAN, wenn zusätzlich die Kontonummer angegeben wird. Ferner wird überprüft, ob die angegebene BLZ bei der Deutschen Bundesbank hinterlegt ist (also ob die existiert). Außerdem wird mit der passenden Prüfsummen-Formel getestet, ob die Kontonummer stimmt (es gibt ein paar Dutzend Prüfsummen-Formeln, die von Bank zu Bank variieren). Schließlich kann aus einer gegebenen IBAN die BLZ und die Kontonummer extrahiert werden und wiederum mittels der individuellen Prüfsummen verifiziert werden.

source: Please keep in mind that check-sums cannot catch all possible errors.
de: Bitte beachte, dass Prüfsummen i.A. nicht alle Fehler finden können.

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details. You should have received a copy of the GNU Affero General Public License along with this program. If not, see {gnuLicenses}.
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 3 der Lizenz oder (nach Ihrer Option) jeder späteren Version. Die Veröffentlichung dieses Programms erfolgt in der Hoffnung, daß es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU General Public License. Sie sollten ein Exemplar der GNU General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, siehe {gnuLicenses}.

source: Undo
de: Rückgängig

source: Redo
de: Wiederherstellen

source: Clear
de: Löschen

source: About
de: Über

source: Close
de: Schließen

source: Errors and Hints
de: Fehler und Hinweise

source: Suggestion
de: Vorschlag

source: Suggestions
de: Vorschläge

source: use
de: verwende

source: Bank Id
de: Bankleitzahl

source: Bank Account Id
de: Kontonummer

source: Bank Account Validator
de: BAV - Bank Account Validator

source: Disable other navigation elements while dialog is open.
de: Hauptnavigation ausschalten während das Eingabefenster geöffnet ist.

source: IBAN of bank account
de: IBAN des Bankkontos

source: BIC of bank
de: BIC des Kreditinstituts

source: Bank id of bank account
de: BLZ des Bankkontos

source: Account Id
de: Kontonummer

source: Id of bank account
de: Kontonummer des Bankkontos

source: Bank Name
de: Name der Bank
