{ "translations": {
    "Failed to validate IBAN" : "Die IBAN scheint nicht korrekt zu sein",
    "Bank-id %1$s from IBAN and submitted bank-id %2$s do not coincide" : "Aus der IBAN abgeleitete BLZ %1$s und angegebene BLZ %2$s stimmen nicht überein",
    "Account-id %1$s from IBAN and submitted account-id %2$s do not coincide" : "Aus der IBAN abgeleitet Kontonummer %1$s und angegebene Kontonummer %2$s stimmen nicht überein",
    "Computed BIC %1$s and submitted BIC %2$s do not coincide" : "Automatisch ermittelte BIC %1$s und angegebene BIC %2$s stimmen nicht überein",
    "Generated IBAN %1$s and submitted IBAN %2$s do not coincide" : "Berechnete IBAN %1$s und angegebene IBAN %2$s stimmen nicht überein",
    "The account number %1$s @ %2$s does not appear to be a valid German bank account id" : "Die Kontonummer %1$s @ %2$s scheint ungültig zu sein",
    "The bank-id %s does not seem to be a valid German bank id" : "Die BLZ %s scheint ungültig zu sein.",
    "No errors found, but use at your own risk" : "Keine Fehler gefunden, aber benutzt das Zeug bitte auf eigenes Risko ;)",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Installationsproblem; die %1$s-Ressource \"%2$s\" ist nicht auf dem Server installiert, bitte kontaktieren Sie den Systemadministrator!",
    "German Bank Account Validator" : "BAV - Bank Account Validator (DE)",
    "BAV" : "BAV",
    "Provided data is not a valid SVG image: \"{data}\"." : "Die Daten konstituieren kein gültiges SVG-Bild: \"{data}\".",
    "reason unknown" : "Grund unbekannt",
    "Unable to validate the given bank account data: {message}" : "Kann die angegebenen Bankdaten nicht überprüfen: {message}",
    "This is a front-end to the German Bank Account Validator (BAV) developed my M. Malkusch." : "Diese App ist ein Front-End für den \"Bank Account Validator\" (BAV),\nder von M. Malkusch für die Überprüfung Deutscher Bankdaten geschrieben wurde.",
    "The backend is no longer actively maintained, but there are some forks on GitHub ({github}).\nHowever, it still seems to work for the majority of German bank accounts." : "Die Programmbibliothek wird nicht mehr gepflegt, aber es gibt noch aktive Ableger auf Github ({github}). Scheinbar funktioniert die Bibliothek aber noch für die meisten Deutschen Bankverbindungen.",
    "Data entered will not be stored. BAV is able to compute\nthe BIC given the bank-id, and to compute the IBAN\ngiven additionally the bank-account id.\nAdditionally, it verifies that the bank-id exists\nby comparing it with the data provided by the Deutsche Bundesbank.\nIt will also pick the correct check-sum formula for the given\nbank-account id (there are a few hundrets of possible\ncheck-sum formulas, differing from bank to bank, all archived and publically\navailable at the Deutsche Bundesbank).\nFinally, given an IBAN, it will extract the bank-id and bank-account-id\nand also perform the check-sum computations in order to test whether the\nprovided bank-account data is consistent." : "Die eingegebenen Daten werden nicht gespeichert. BAV kann die BIC aus\nder BLZ berechnen, und außerdem die IBAN, wenn zusätzlich die\nKontonummer angegeben wird. Ferner wird überprüft, ob die angegebene\nBLZ bei der Deutschen Bundesbank hinterlegt ist (also ob die\nexistiert). Außerdem wird mit der passenden Prüfsummen-Formel\ngetestet, ob die Kontonummer stimmt (es gibt ein paar Dutzend\nPrüfsummen-Formeln, die von Bank zu Bank variieren). Schließlich kann\naus einer gegebenen IBAN die BLZ und die Kontonummer extrahiert werden\nund wiederum mittels der individuellen Prüfsummen verifiziert\nwerden.",
    "Please keep in mind that check-sums\ncannot catch all possible errors." : "Bitte beachte, dass Prüfsummen i.A. nicht alle Fehler finden können.",
    "This program is free software: you can redistribute it and/or modify\nit under the terms of the GNU Affero General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU Affero General Public License for more details.\n\nYou should have received a copy of the GNU Affero General Public License\nalong with this program.  If not, see {gnuLicenses}." : "Dieses Programm ist freie Software. Sie können es unter den\nBedingungen der GNU Affero General Public License, wie von der Free\nSoftware Foundation veröffentlicht, weitergeben und/oder modifizieren,\nentweder gemäß Version 3 der Lizenz oder (nach Ihrer Option) jeder\nspäteren Version.\n\nDie Veröffentlichung dieses Programms erfolgt in der Hoffnung, daß es\nIhnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne\ndie implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR\nEINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU Affero General\nPublic License.\n\nSie sollten ein Exemplar der GNU Affero General Public License zusammen mit\ndiesem Programm erhalten haben. Falls nicht, siehe\n{gnuLicenses}.",
    "BAV - Bank Account Validator (DE)" : "BAV - Bank Account Validator (DE)",
    "Undo" : "Rückgängig",
    "Redo" : "Wiederherstellen",
    "Clear" : "Löschen",
    "About" : "Über",
    "Close" : "Schließen",
    "app-logo" : "App-Logo",
    "Errors and Hints" : "Fehler und Hinweise",
    "Suggestion" : "Vorschlag",
    "Suggestions" : "Vorschläge",
    "use" : "verwende",
    "IBAN" : "IBAN",
    "BIC" : "BIC",
    "Bank Id" : "Bankleitzahl",
    "Bank Account Id" : "Kontonummer",
    "Bank" : "Bank"
},"pluralForm" :"nplurals=2; plural=(n != 1)"
}